Series in pandas is a column in a table

In [195]:
import numpy as np
import pandas as pd

In [196]:
#series storing strings

In [197]:
countries = ['India','Pakistan','England','Wales','Scotland','North Ireland']

pd.Series(countries)

0            India
1         Pakistan
2          England
3            Wales
4         Scotland
5    North Ireland
dtype: object

In [198]:
#series for integer values

In [199]:
pd.Series([12,34,45,33,199])

0     12
1     34
2     45
3     33
4    199
dtype: int64

In [200]:
#custom indexing

In [201]:
subjects=['maths','english','chemistry','physics','DAA']
marks=[12,23,44,22,12]
pd.Series(marks,index=subjects)

maths        12
english      23
chemistry    44
physics      22
DAA          12
dtype: int64

In [202]:
#Naming our series!
pd.Series(marks,index=subjects,name='Faisal\'s marks')

maths        12
english      23
chemistry    44
physics      22
DAA          12
Name: Faisal's marks, dtype: int64

In [203]:
#turning dict's into pandas Series
dict={
    'maths':44,
    'python':44,
    'DAA':34,
    'ALTC':50,
}

marks_series = pd.Series(dict,name='Faisal\'s marks')

In [204]:
marks_series.size

4

In [205]:
marks_series.dtype

dtype('int64')

In [206]:

marks_series.name

"Faisal's marks"

In [207]:
marks_series.is_unique

False

In [208]:
marks_series.index

Index(['maths', 'python', 'DAA', 'ALTC'], dtype='object')

In [209]:
marks_series.values  #returns a numpy array

array([44, 44, 34, 50])

In [210]:
test = pd.read_csv('student_performance.csv')

In [211]:
Student_details = pd.read_csv('student_performance.csv',index_col='StudentID')

In [212]:
test.head(29)

,StudentID,Name,Gender,AttendanceRate,StudyHoursPerWeek,PreviousGrade,ExtracurricularActivities,ParentalSupport,FinalGrade
0,1,John,Male,85,15,78,1,High,80
1,2,Sarah,Female,90,20,85,2,Medium,87
2,3,Alex,Male,78,10,65,0,Low,68
3,4,Michael,Male,92,25,90,3,High,92
4,5,Emma,Female,88,18,82,2,Medium,85
5,6,Olivia,Female,95,30,88,1,High,90
6,7,Daniel,Male,70,8,60,0,Low,62
7,8,Sophia,Female,85,17,77,1,Medium,78
8,9,James,Male,82,12,70,2,Low,72
9,10,Isabella,Female,91,22,86,3,High,88

In [213]:
Student_details.size

80

In [214]:
Student_details.dtypes

Name                         object
Gender                       object
AttendanceRate                int64
StudyHoursPerWeek             int64
PreviousGrade                 int64
ExtracurricularActivities     int64
ParentalSupport              object
FinalGrade                    int64
dtype: object

But Student_details is in a PANDAS Dataframe. We want it in Series. Previously was achieved using squeeze argument. But now thats not supported

In [215]:
New_method = pd.DataFrame.squeeze(Student_details)

In [216]:
New_method

,Name,Gender,AttendanceRate,StudyHoursPerWeek,PreviousGrade,ExtracurricularActivities,ParentalSupport,FinalGrade
StudentID,,,,,,,,
1,John,Male,85,15,78,1,High,80
2,Sarah,Female,90,20,85,2,Medium,87
3,Alex,Male,78,10,65,0,Low,68
4,Michael,Male,92,25,90,3,High,92
5,Emma,Female,88,18,82,2,Medium,85
6,Olivia,Female,95,30,88,1,High,90
7,Daniel,Male,70,8,60,0,Low,62
8,Sophia,Female,85,17,77,1,Medium,78
9,James,Male,82,12,70,2,Low,72
10,Isabella,Female,91,22,86,3,High,88

In [217]:
marks_series.tail()

maths     44
python    44
DAA       34
ALTC      50
Name: Faisal's marks, dtype: int64

In [218]:
marks_series

maths     44
python    44
DAA       34
ALTC      50
Name: Faisal's marks, dtype: int64

In [219]:
student_marks = pd.Series(np.random.randint(1,10,20),name="Student_marks")

In [220]:
student_marks.tail()

15    9
16    3
17    7
18    2
19    2
Name: Student_marks, dtype: int32

In [221]:
Student_details.tail()

,Name,Gender,AttendanceRate,StudyHoursPerWeek,PreviousGrade,ExtracurricularActivities,ParentalSupport,FinalGrade
StudentID,,,,,,,,
6,Olivia,Female,95,30,88,1,High,90
7,Daniel,Male,70,8,60,0,Low,62
8,Sophia,Female,85,17,77,1,Medium,78
9,James,Male,82,12,70,2,Low,72
10,Isabella,Female,91,22,86,3,High,88

In [222]:
test

,StudentID,Name,Gender,AttendanceRate,StudyHoursPerWeek,PreviousGrade,ExtracurricularActivities,ParentalSupport,FinalGrade
0,1,John,Male,85,15,78,1,High,80
1,2,Sarah,Female,90,20,85,2,Medium,87
2,3,Alex,Male,78,10,65,0,Low,68
3,4,Michael,Male,92,25,90,3,High,92
4,5,Emma,Female,88,18,82,2,Medium,85
5,6,Olivia,Female,95,30,88,1,High,90
6,7,Daniel,Male,70,8,60,0,Low,62
7,8,Sophia,Female,85,17,77,1,Medium,78
8,9,James,Male,82,12,70,2,Low,72
9,10,Isabella,Female,91,22,86,3,High,88

In [223]:
student_marks.sample()

0    3
Name: Student_marks, dtype: int32

In [224]:
student_marks.sample(6)

6     3
8     1
7     2
11    7
3     9
19    2
Name: Student_marks, dtype: int32

In [225]:
student_marks

0     3
1     1
2     8
3     9
4     8
5     4
6     3
7     2
8     1
9     3
10    4
11    7
12    4
13    5
14    3
15    9
16    3
17    7
18    2
19    2
Name: Student_marks, dtype: int32

In [226]:
student_marks.value_counts()

Student_marks
3    5
4    3
2    3
1    2
9    2
8    2
7    2
5    1
Name: count, dtype: int64

In [227]:
(student_marks.sort_values(ascending=False))

3     9
15    9
4     8
2     8
17    7
11    7
13    5
12    4
10    4
5     4
14    3
0     3
6     3
16    3
9     3
18    2
19    2
7     2
1     1
8     1
Name: Student_marks, dtype: int32

In [228]:
(student_marks.sort_values(ascending=False)).head(1).values[0]

np.int32(9)

In [229]:
#making permanent changes to series by using inplace parameter

In [230]:
marks_series

maths     44
python    44
DAA       34
ALTC      50
Name: Faisal's marks, dtype: int64

In [231]:
marks_series.sort_values(ascending=False,inplace=True)

In [232]:
Student_name = ['faisal','rizwan','118samad','zain']
Student_marks = [58,23,100,23]

results = pd.Series(Student_marks)

In [233]:
results.sort_index(ascending=False)#here it again accepts the inplace parameter

3     23
2    100
1     23
0     58
dtype: int64

In [234]:
marks_series

ALTC      50
maths     44
python    44
DAA       34
Name: Faisal's marks, dtype: int64

In [235]:
marks_series.sort_index()#sorting as per the index here, in the series function index parameter has been set to list of subjects hence the sorting is done on that basis

ALTC      50
DAA       34
maths     44
python    44
Name: Faisal's marks, dtype: int64